In [59]:
# info and describe
import pandas as pd
exam_scores = pd.read_csv("data/exam_scores.csv")

## Describe
**Retorna el resumen sobre solo las columnas numericas por defecto**

In [3]:
exam_scores.describe()

        math score  reading score  writing score
count  1000.000000     1000.00000    1000.000000
mean     67.128000       70.17400      68.973000
std      14.815367       14.85599      15.109155
min      15.000000       18.00000      10.000000
25%      58.000000       60.00000      59.000000
50%      67.000000       70.00000      69.000000
75%      78.000000       81.00000      80.000000
max     100.000000      100.00000     100.000000

In [4]:
# Tome en cuenta solo las columnas de tipo object o que sean categoricas es decir no numericas
exam_scores.describe(include='object')

,gender,race/ethnicity,parental level of education,lunch,test preparation course
count,1000,1000,1000,1000,1000
unique,2,5,6,2,2
top,female,group C,some college,standard,none
freq,502,294,226,649,654

In [5]:
exam_scores.describe(include='all')

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
count,1000,1000,1000,1000,1000,1000.000000,1000.00000,1000.000000
unique,2,5,6,2,2,NaN,NaN,NaN
top,female,group C,some college,standard,none,NaN,NaN,NaN
freq,502,294,226,649,654,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,67.128000,70.17400,68.973000
std,NaN,NaN,NaN,NaN,NaN,14.815367,14.85599,15.109155
min,NaN,NaN,NaN,NaN,NaN,15.000000,18.00000,10.000000
25%,NaN,NaN,NaN,NaN,NaN,58.000000,60.00000,59.000000
50%,NaN,NaN,NaN,NaN,NaN,67.000000,70.00000,69.000000
75%,NaN,NaN,NaN,NaN,NaN,78.000000,81.00000,80.000000
max,NaN,NaN,NaN,NaN,NaN,100.000000,100.00000,100.000000

## Descripción del resumen
1. count: conteo de las entradas no-null de una sola columna
2. unique: conteo de los valores unicos en una columna
3. top: solo para la columna categorica, cual valor es el que ocurre en el número maximo de veces 
4. freq: solo para la columna categorica, numero de las ocrruencia del valor top
5. mean: el valor medio para columna numerica
6. std: es la desviación estándar de la columna numerica, indicando la variación de datos
7. min: el valor minimo en la columna numerica
8. 25%: El valor percentil (posición o rango de lista de datos) que esta por encima del 25% de los datos ordenados
9. 50%  El valor percentil en el 50% 
10. 75: El valor percentil en el 50%
11. Max: El maximo valor numerico de la columna numerica.

**Nota: los valores <em>Nan</em> significan que estos valores no estan disponibles**

**Describe particular**

In [6]:
exam_scores['math score'].describe()

count    1000.000000
mean       67.128000
std        14.815367
min        15.000000
25%        58.000000
50%        67.000000
75%        78.000000
max       100.000000
Name: math score, dtype: float64

In [7]:
exam_scores.gender.describe()

count       1000
unique         2
top       female
freq         502
Name: gender, dtype: object

## Funciones de Agregación
**mean, median, unique**

In [60]:
# Reducción a solo las columnas numericas
exam_scores_only_numeric = exam_scores.select_dtypes(include=['int64'])
exam_scores_only_numeric.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   math score     1000 non-null   int64
 1   reading score  1000 non-null   int64
 2   writing score  1000 non-null   int64
dtypes: int64(3)
memory usage: 23.6 KB

In [61]:
exam_scores_only_numeric.mean()

math score       67.128
reading score    70.174
writing score    68.973
dtype: float64

In [62]:
exam_scores.gender.unique()

array(['male', 'female'], dtype=object)

In [63]:
exam_scores.gender.value_counts()

female    502
male      498
Name: gender, dtype: int64